tutorials/incompressibleFluid/ductSecondaryFlow/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 1.95);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    bottomWall
    {
        type            noSlip;
    }

    leftWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
